In [13]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [34]:
df = sns.load_dataset('titanic')

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [22]:
df = sns.load_dataset('flights')

In [36]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [33]:

df['month_number'] = pd.to_datetime(df['month'], format='%mmmm')

ValueError: time data "Jan" doesn't match format "%mmmm", at position 0. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [37]:
import pandas as pd

# Sample data with mixed date formats
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'raw_date': [
        '2025-10-06',     # ISO format
        '06/10/2025',     # European format (DD/MM/YYYY)
        '10/06/2025',     # US format (MM/DD/YYYY)
        'October 6, 2025',# Full month name
        '06-Oct-2025',    # Abbreviated month
        '20251006'        # Compact YYYYMMDD
    ]
}

# Create DataFrame
df = pd.DataFrame(data)

print(df)

   id         raw_date
0   1       2025-10-06
1   2       06/10/2025
2   3       10/06/2025
3   4  October 6, 2025
4   5      06-Oct-2025
5   6         20251006

In [38]:
df

   id         raw_date
0   1       2025-10-06
1   2       06/10/2025
2   3       10/06/2025
3   4  October 6, 2025
4   5      06-Oct-2025
5   6         20251006

In [49]:
pd.to_datetime(df['raw_date'], errors='coerce')

0   2025-10-06
1          NaT
2          NaT
3          NaT
4          NaT
5          NaT
Name: raw_date, dtype: datetime64[ns]

In [59]:
a = pd.to_datetime(df["raw_date"][1:2], format='mixed')

In [61]:
a.dt

In [64]:
a.dt.year

1    2025
Name: raw_date, dtype: int32

In [65]:
a.dt.month

1    6
Name: raw_date, dtype: int32

In [67]:
a.dt.month_name()

1    June
Name: raw_date, dtype: object

In [70]:
import pandas as pd

# Sample sales data
data = {
    'sale_id': [101, 102, 103, 104, 105],
    'product': ['Widget', 'Gadget', 'Widget', 'Thingy', 'Gadget'],
    'quantity': [3, 5, 2, 7, 1],
    'price_per_unit': [20.0, 15.5, 20.0, 10.0, 15.5],
    'sale_date': [
        '2025-10-01',
        '2025-10-02',
        '2025-10-03',
        '2025-10-03',
        '2025-10-04'
    ]
}

# Create DataFrame
df = pd.DataFrame(data)

# Calculate total

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sale_id         5 non-null      int64
 1   product         5 non-null      object
 2   quantity        5 non-null      int64
 3   price_per_unit  5 non-null      float64
 4   sale_date       5 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [74]:
df['order_date'] = pd.to_datetime(df['sale_date'])

In [75]:
df

   sale_id product  quantity  price_per_unit   sale_date order_date
0      101  Widget         3            20.0  2025-10-01 2025-10-01
1      102  Gadget         5            15.5  2025-10-02 2025-10-02
2      103  Widget         2            20.0  2025-10-03 2025-10-03
3      104  Thingy         7            10.0  2025-10-03 2025-10-03
4      105  Gadget         1            15.5  2025-10-04 2025-10-04

In [86]:
df['order_date'].dt.day_name()

0    Wednesday
1     Thursday
2       Friday
3       Friday
4     Saturday
Name: order_date, dtype: object

In [88]:
df.groupby(df['order_date'].dt.day_name()).sum('price_per_unit')

            sale_id  quantity  price_per_unit
order_date
Friday          207         9            30.0
Saturday        105         1            15.5
Thursday        102         5            15.5
Wednesday       101         3            20.0